/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_striteri.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gimhwang <gimhwang@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/12/22 12:44:06 by donchoi           #+#    #+#             */
/*   Updated: 2022/09/12 13:02:30 by gimhwang         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//문자열을 순회하면서 함수 f를 적용시키는 함수 
//f인자값이 문자형포인터인 이유는 함수에서 직접 함수를 적용할 수 있도록
void	ft_striteri(char *s, void (*f)(unsigned int, char*))
{
	unsigned int	i;

	if (!s || !f)//입력값 예외처리
		return ;
	i = 0;
	while (s[i] != '\0')
	{
		f(i, s + i);
		i++;
	}
}
